pkg/wsman/wsmantesting/responses/ips/hostbasedsetup/get.xml

<?xml version="1.0" encoding="UTF-8"?>
<a:Envelope xmlns:a="http://www.w3.org/2003/05/soap-envelope"
    xmlns:b="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:c="http://schemas.dmtf.org/wbem/wsman/1/wsman.xsd"
    xmlns:d="http://schemas.xmlsoap.org/ws/2005/02/trust"
    xmlns:e="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:f="http://schemas.dmtf.org/wbem/wsman/1/cimbinding.xsd"
    xmlns:g="http://intel.com/wbem/wscim/1/ips-schema/1/IPS_HostBasedSetupService"
    xmlns:h="http://schemas.dmtf.org/wbem/wscim/1/common"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <a:Header>
        <b:To>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</b:To>
        <b:RelatesTo>0</b:RelatesTo>
        <b:Action a:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/09/transfer/GetResponse</b:Action>
        <b:MessageID>uuid:00000000-8086-8086-8086-0000000032E9</b:MessageID>
        <c:ResourceURI>http://intel.com/wbem/wscim/1/ips-schema/1/IPS_HostBasedSetupService</c:ResourceURI>
    </a:Header>
    <a:Body>
        <g:IPS_HostBasedSetupService>
            <g:AllowedControlModes>2</g:AllowedControlModes>
            <g:AllowedControlModes>1</g:AllowedControlModes>
            <g:CertChainStatus>0</g:CertChainStatus>
            <g:ConfigurationNonce>4P3sY7swlhjkhJNxDkEBIUcmpHE=</g:ConfigurationNonce>
            <g:CreationClassName>IPS_HostBasedSetupService</g:CreationClassName>
            <g:CurrentControlMode>2</g:CurrentControlMode>
            <g:ElementName>Intel(r) AMT Host Based Setup Service</g:ElementName>
            <g:Name>Intel(r) AMT Host Based Setup Service</g:Name>
            <g:SystemCreationClassName>CIM_ComputerSystem</g:SystemCreationClassName>
            <g:SystemName>Intel(r) AMT</g:SystemName>
        </g:IPS_HostBasedSetupService>
    </a:Body>
</a:Envelope>